examples/delta-wing-2p2o-hpc/input/case_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         20.0;

deltaT          0.05;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

allowSystemOperations 1;

OptimisationSwitches
{
    fileHandler collated;
    maxThreadFileBufferSize 2e9;
    maxMasterFileBufferSize 2e9;
}

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;

        libs            (forces);

        writeControl    timeStep;
        writeInterval   1;

        log             yes;

        patches         (solid);
        rho             rhoInf;
        rhoInf          1.225;
        liftDir         (0 0 1);
        dragDir         (1 0 0);
        CofR            (0.375 0 0);   // DYNAMIC
        pitchAxis       (0 1 0);
        magUInf         10;
        lRef            1.5;           // DYNAMIC
        Aref            0.7125;        // DYNAMIC
    }
    
    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
    }

    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        patches         (solid);
        writeToFile     true;
    }

    binField1
    {
        type                    binField;
        libs                    (fieldFunctionObjects);
        binModel                singleDirectionUniformBin;
        fields                  (force);
        patches                 (solid);
        decomposePatchValues    yes;
        CofR                    (0.2275 0 0);  // DYNAMIC

        binData
        {
            nBin        30;          // output data into n bins
            direction   (1 0 0);     // bin direction
            cumulative  yes;
        }
        writeControl            writeTime;
    }
}

// ************************************************************************* //
